In [1]:
import json
# f_open = json.loads('F:/herbarium-2020_data/nybg2020/train/metadata.json')

with open('F:/herbarium-2020_data/nybg2020/train/metadata.json', 'r') as json_file:
    data = json.load(json_file)
    for anot in data:
        print(anot, len(data[anot]))

annotations 1030747
categories 32094
images 1030747
info 6
licenses 1
regions 4

In [2]:
import pandas as pd

df_annotations = pd.DataFrame(data['annotations'])

In [3]:
df_annotations.head(3)

   category_id      id  image_id  region_id
0        15672  354106    354106          1
1        11524  818566    818566          1
2        11524  750704    750704          1

In [4]:
df_categories = pd.DataFrame(data['categories'])

In [5]:
df_categories.head(3)

        family    genus  id                                               name
0  Orchidaceae       Aa   0                     Aa mathewsii (Rchb.f.) Schltr.
1  Orchidaceae       Aa   1                        Aa paleacea (Kunth) Rchb.f.
2     Fabaceae  Abarema   2  Abarema abbottii (Rose & Leonard) Barneby & J....

In [6]:
df_images = pd.DataFrame(data['images'])

In [7]:
df_images.head(3)

                  file_name  height      id  license  width
0  images/156/72/354106.jpg    1000  354106        1    661
1  images/115/24/818566.jpg    1000  818566        1    661
2  images/115/24/750704.jpg    1000  750704        1    661

In [9]:
df_infos = data['info']

In [10]:
df_licenses = data['licenses']

In [11]:
df_regions = data['regions']

In [12]:
df_images.head(4)

                  file_name  height      id  license  width
0  images/156/72/354106.jpg    1000  354106        1    661
1  images/115/24/818566.jpg    1000  818566        1    661
2  images/115/24/750704.jpg    1000  750704        1    661
3  images/114/67/722381.jpg    1000  722381        1    661

In [13]:
df_categories.head(4)

        family    genus  id                                               name
0  Orchidaceae       Aa   0                     Aa mathewsii (Rchb.f.) Schltr.
1  Orchidaceae       Aa   1                        Aa paleacea (Kunth) Rchb.f.
2     Fabaceae  Abarema   2  Abarema abbottii (Rose & Leonard) Barneby & J....
3     Fabaceae  Abarema   3                Abarema acreana (J.F.Macbr.) L.Rico

In [14]:
df_annotations.head(4)

   category_id      id  image_id  region_id
0        15672  354106    354106          1
1        11524  818566    818566          1
2        11524  750704    750704          1
3        11467  722381    722381          1

In [15]:
df_regions

[{'id': 0, 'name': 'Mexico & Central America'},
 {'id': 1, 'name': 'South America'},
 {'id': 2, 'name': 'US & Canada'},
 {'id': 3, 'name': 'West Indies'}]

In [49]:
print("NB Catégories =>", len(df_categories.id))
print("NB images par catégories =>", len(df_annotations.category_id.unique()))

NB Catégories => 32094
NB image par catégories => 32093